Revit 2026 API

# TextNoteOptionsKeepRotatedTextReadable Property

---

Flag controling whether a rotate text is to stay oriented to be always readable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool KeepRotatedTextReadable { get; set; }
```
```vb
Public Property KeepRotatedTextReadable As Boolean
	Get
	Set
```
```cpp
public:
property bool KeepRotatedTextReadable {
	bool get ();
	void set (bool value);
}
```
```fsharp
member KeepRotatedTextReadable : bool with get, set
```

#### Property Value

Boolean

Default value is True.

#### Reference

TextNoteOptions Class

Autodesk.Revit.DB Namespace